In [1]:
import pandas as pd
import numpy as np

# DTW Clustering Analysis

## Passo 1: padronizar os dados (de 0 a 1). Cada valor é dividido pelo valor máximo da série.

In [2]:
# Transformando as series em lista (para ser iteradas)
import os
list_files = os.listdir('./data/')

FileNotFoundError: [Errno 2] No such file or directory: './data/'

In [27]:


list_ok = []
list_error = []

# Lendo e salvando cada serie de forma padronizada
for file in list_files:
    print(file,end='... ')
    try:
        temp_df = pd.read_csv('./data/'+file, encoding='latin1', sep=';')[:-1]
        values = temp_df.columns[-1]
        temp_df[values] = temp_df[values].str.replace('.','').astype('float')
        temp_df[values] = temp_df[values]/np.max(temp_df[values])
        temp_df.to_csv('./data/'+file)
#         print('ok')
        list_ok.append(file)
    except:
#         print('ok')
        list_error.append(file)

4193.csv... 2974.csv... 4248.csv... 4221.csv... 10798.csv... 1561.csv... 2947.csv... 11071.csv... 4194.csv... 2946.csv... 1620.csv... 1483.csv... 10799.csv... 1402.csv... 1548.csv... 3001.csv... 2852.csv... 1509.csv... 1522.csv... 3034.csv... 11068.csv... 10796.csv... 2860.csv... 11067.csv... 2851.csv... 10797.csv... 11070.csv... 4380.csv...

In [32]:
for file in list_files:
    display(pd.read_csv('./data/'+file, encoding='latin1').head(2))

   Unnamed: 0     Data  4193 - ExportaÃ§Ãµes (Kg) - Total - kg
0           0  10/2001                                0.446975
1           1  11/2001                                0.380518

,Unnamed: 0,Data,2974 - ExportaÃ§Ãµes - Produtos semimanufaturados - US$
0,0,10/2001,0.263853
1,1,11/2001,0.235165

,Unnamed: 0,Data,4248 - ExportaÃ§Ãµes (Kg) - Produtos manufaturados - kg
0,0,10/2001,0.505281
1,1,11/2001,0.490161

,Unnamed: 0,Data,4221 - ExportaÃ§Ãµes (Kg) - Produtos semimanufaturados - kg
0,0,10/2001,0.629578
1,1,11/2001,0.650353

            Data;10798 - Distribuição de desocupados segundo o tempo de procura de emprego - De 7 a 11 meses - %
10/2001;11                                                4.0
11/2001;10                                                7.0

            Data;1561 - Índice volume de vendas no varejo - Hipermercados e supermercados - Brasil - Índice
10/2001;57                                               50.0
11/2001;56                                               80.0

   Unnamed: 0     Data  2947 - ExportaÃ§Ãµes - Produtos bÃ¡sicos - US$
0           0  10/2001                                        0.162920
1           1  11/2001                                        0.126985

             Data;11071 - Indicadores da produção (2002=100) - Por categoria de uso - Bens de consumo (não-duráveis e semiduráveis) - Índice
10/2001;111                                                5.0
11/2001;111                                               66.0

   Unnamed: 0     Data  4194 - ExportaÃ§Ãµes (Kg) - Produtos bÃ¡sicos - kg
0           0  10/2001                                           0.403220
1           1  11/2001                                           0.323645

   Unnamed: 0     Data  2946 - ExportaÃ§Ãµes - Total - US$
0           0  10/2001                            0.244900
1           1  11/2001                            0.220341

           Data;1620 - Taxa de desemprego - Região metropolitana - Brasil (na semana) - Desativada - Var. % mensal
10/2001;6                                               55.0
11/2001;6                                               40.0

            Data;1483 - Índice volume de vendas no varejo - Combustíveis e lubrificantes - Brasil - Índice
10/2001;78                                               10.0
11/2001;75                                               20.0

            Data;10799 - Distribuição de desocupados segundo o tempo de procura de emprego - Mais de 1 ano - %
10/2001;25                                                8.0
11/2001;25                                                6.0

   Unnamed: 0     Data  1402 - Consumo de energia elÃ©trica - Comercial - GWh
0           0  10/2001                                           0.573184
1           1  11/2001                                           0.598807

,Data;1548 - Índice volume de vendas no varejo - Automóveis,motocicletas,partes e peças - Brasil - Índice
0,10/2001;54,10.0,NaN
1,11/2001;50,90.0,NaN

   Unnamed: 0     Data  3001 - ExportaÃ§Ãµes - Produtos manufaturados - US$
0           0  10/2001                                           0.299370
1           1  11/2001                                           0.285785

              Data;2852 - Investimento brasileiro direto - IBD (líquido) - mensal - US$ (milhões)
10/2001;11                                                  7.0
11/2001;-416                                                4.0

,Data;1509 - Índice volume de vendas no varejo - Tecido,vestuário e calçado - Brasil - Índice
0,10/2001;63,90.0
1,11/2001;69,0.0

            Data;1522 - Índice volume de vendas no varejo - Móveis e eletrodomésticos - Brasil - Índice
10/2001;28                                               50.0
11/2001;28                                               40.0

   Unnamed: 0     Data  3034 - ImportaÃ§Ãµes - Total (MDIC) - US$
0           0  10/2001                                   0.272774
1           1  11/2001                                   0.241510

            Data;11068 - Indicadores da produção (2002=100) - Por categoria de uso - Bens intermediários - Índice
10/2001;97                                               69.0
11/2001;93                                               82.0

            Data;10796 - Distribuição de desocupados segundo o tempo de procura de emprego - Até 30 dias - %
10/2001;26                                                0.0
11/2001;24                                                6.0

               Data;2860 - Investimento estrangeiro direto - IED (líquido) - mensal - US$ (milhões)
10/2001;1.335                                                1.0
11/2001;2.181                                                9.0

             Data;11067 - Indicadores da produção (2002=100) - Por categoria de uso - Bens de capital - Índice
10/2001;110                                               60.0
11/2001;102                                               58.0

               Data;2851 - Investimento direto total (líquido) - mensal - US$ (milhões)
10/2001;1.346                                                8.0
11/2001;1.765                                                5.0

            Data;10797 - Distribuição de desocupados segundo o tempo de procura de emprego - De 31 dias a 6 meses - %
10/2001;36                                                8.0
11/2001;39                                                1.0

             Data;11070 - Indicadores da produção (2002=100) - Por categoria de uso - Bens de consumo (duráveis) - Índice
10/2001;98                                                92.0
11/2001;102                                               96.0

                 Data;4380 - PIB mensal - Valores correntes (R$ milhões) - R$ (milhões)
10/2001;116.139                                                0.0
11/2001;117.882                                                0.0

In [11]:
list_ok

[]

In [5]:
temp_df

       Data  4193 - Exportações (Kg) - Total - kg
0   10/2001                              0.446975
1   11/2001                              0.380518
2   12/2001                              0.358525
3   01/2002                              0.360068
4   02/2002                              0.314185
5   03/2002                              0.378896
6   04/2002                              0.426046
7   05/2002                              0.339408
8   06/2002                              0.216393
9   07/2002                              0.678858
10  08/2002                              0.584247
11  09/2002                              0.635379
12  10/2002                              0.526747
13  11/2002                              0.423015
14  12/2002                              0.406052
15  01/2003                              0.460915
16  02/2003                              0.424666
17  03/2003                              0.436951
18  04/2003                              0.480577
19  05/2003                              0.528098
20  06/2003                              0.431569
21  07/2003                              0.444336
22  08/2003                              0.446343
23  09/2003                              0.607965
24  10/2003                              0.652303
25  11/2003                              0.434628
26  12/2003                              0.397581
27  01/2004                              0.584986
28  02/2004                              0.442919
29  03/2004                              0.660482
..      ...                                   ...
61  11/2006                              0.633764
62  12/2006                              0.593737
63  01/2007                              0.644219
64  02/2007                              0.558045
65  03/2007                              0.644487
66  04/2007                              0.655996
67  05/2007                              0.707244
68  06/2007                              0.636398
69  07/2007                              0.813530
70  08/2007                              0.784525
71  09/2007                              0.699905
72  10/2007                              0.787623
73  11/2007                              0.662471
74  12/2007                              0.665922
75  01/2008                              0.669295
76  02/2008                              0.627951
77  03/2008                              0.461107
78  04/2008                              0.570052
79  05/2008                              1.000000
80  06/2008                              0.777405
81  07/2008                              0.838546
82  08/2008                              0.772826
83  09/2008                              0.797441
84  10/2008                              0.759719
85  11/2008                              0.580416
86  12/2008                              0.535989
87  01/2009                              0.533828
88  02/2009                              0.532665
89  03/2009                              0.647875
90  04/2009                              0.720752

[91 rows x 2 columns]